const TermsOfUse = () => {
  return (
    <div>
      <h1>이용 약관</h1>
      <p>
        <strong>최종 업데이트:</strong> 25.2.25
      </p>
      <p>
        babyloop은(는) 귀하의 이용 경험을 향상시키기 위해 최선을 다하고 있으며,
        본 이용 약관은 귀하가 당사 웹사이트 및 서비스를 이용함에 있어 준수해야
        할 조건과 책임에 대해 설명합니다.
      </p>

      <h2>1. 약관 동의</h2>
      <p>
        웹사이트에 접속하거나 서비스를 이용함으로써 귀하는 본 이용 약관에
        동의하는 것으로 간주됩니다. 약관에 동의하지 않는 경우, 웹사이트 이용을
        중단해 주시기 바랍니다.
      </p>

      <h2>2. 사용자 의무</h2>
      <ul>
        <li>
          귀하는 웹사이트 이용 시 관련 법령 및 본 약관의 모든 조항을 준수해야
          합니다.
        </li>
        <li>
          귀하는 서비스 이용 시 허위 정보 제공, 불법 행위, 타인의 권리를
          침해하는 행위를 해서는 안 됩니다.
        </li>
        <li>
          귀하는 계정 정보를 안전하게 관리할 책임이 있으며, 타인의 계정을
          도용하거나 부정하게 이용해서는 안 됩니다.
        </li>
      </ul>

      <h2>3. 콘텐츠 및 저작권</h2>
      <p>
        웹사이트 내 모든 콘텐츠(텍스트, 이미지, 동영상 등)의 저작권은 [사이트
        이름] 또는 정당한 권리자에게 있으며, 사전 허락 없이 무단 복제, 배포,
        전송, 변형할 수 없습니다.
      </p>

      <h2>4. 서비스 제한 및 중단</h2>
      <p>
        당사는 서비스의 원활한 운영을 위해 필요 시, 사전 통지 없이 서비스의 일부
        또는 전부를 제한하거나 중단할 수 있습니다.
      </p>

      <h2>5. 책임 제한</h2>
      <p>
        당사는 웹사이트 이용과 관련하여 발생할 수 있는 직접적, 간접적, 우발적,
        특수 또는 결과적 손해에 대해 책임을 지지 않습니다.
      </p>

      <h2>6. 약관의 변경</h2>
      <p>
        당사는 필요에 따라 본 이용 약관을 변경할 수 있으며, 변경 사항은
        웹사이트에 공지된 시점부터 효력이 발생합니다. 변경된 약관은 귀하가
        서비스를 계속 이용하는 경우 동의한 것으로 간주됩니다.
      </p>

      <p>
        본 이용 약관에 대해 문의 사항이 있으시면 [이메일 주소]로 연락해 주시기
        바랍니다.
      </p>
    </div>
  );
};

export default TermsOfUse;
